# 1) შექმენით ფუნქცია greet და დააბრუნეთ მისასალმებელი ტექსტი return ის საშუალებით

# 2) შექმენით ფუნქცია add რომელსაც გადაეცემა ორი რიცხვი და შემდეგ დააბრუნეთ მათი ჯამი


# 3) შექმენით ფუნქცია multiply რომელსაც გადაეცემა ორი რიცხვი  შემდეგ კი დააბრუნეთ მათი ნამრავლი

# 4) კომენტარებით ახსენით რა არის არგუმენტი და რა არის პარამეტრი,ასევე რატომ ვიყენებთ ფუნქციებს

# 5) შექმენი ფუნქცია სახელად filter რომელსაც გადაეცემა რიცხვი, თქვენი დავალებაა შეამოწმოთ ეს რიცხვი 
# ლუწია თუ კენტი და დააბრუნოთ შესაბამისი შედეგი even ან odd



# 1)

def greet(Name):
    return "Hello", Name
print(greet("Niko"))

# 2)

def add(num1,num2):
    print(num1 + num2)
add(21,43)

# 3)

def multiply(num3,num4):
    print(num3 * num4)
multiply(2,5)



# 4)

#parameter - პარამეტრი არის ფუნქციის შექმნის დროს დროებითი ცვლადი

# argument - არგუმენტი არის ფრჩხილებში გადაცემული მნიშვნელობა

# ჩვენ ფუნქციებს ვიყენებთ რომ ფუნქციონალური იყოს ჩვენი დაწერილი კოდი



# 5)

def filter(num):
    if num % 2 == 0:
        print("Even")
    else:
        print("Odd")