#1) შეასრულე Sololearn ეს ორი თავი.

#2) შექმენი ფორ ციკლი სადაც გამოიტან Goa-ს 100-ჯერ.

#3) შექმენი ფორ ციკლი რომელიც გამოიტანს 1-დან 100-მდე 
#რიცხვებს და ყოველ იტერაციაზე უნდა დაემატოს(step) 5-იანი 
#და საბოლოოდ შედეგი გამოიტანე ტერმინალში.

#4) for i in range(1,10,3) კომენტარებით ახსენი კოდის თითოეული 
#ნაწილი.
#print(i)

#5) აუცილებლად გადახედე ჩანაწერს.

for i in range(100):
    print('Goa')


for i in range(1,100,5):
    print(i)

#for i in range(1,10,3) - 1-ანი არის რა რიცხვიდანაც დაიწყება ათვლა
#იმის მიმანიშნებელი 10 - ანი არის რა რიცხვამდე დაითვლის ტერმინალი
#3 - ანი იმის მიმანიშნებელია თუ რამდენი რიცხვით გადადგავს ანუ ათვლის რიცხვს
#(i) - არის რიცხვითი ათვლის მიმანიშნებელი თუ i არ იქნება მაშინ
#ფრჩხილებში ჩასმული სიტყვა,სიტყვები ან ციფრებს გამოიყვანს ტერმინალი
#იმ შემთხვევაში თუ არაფერი არ წერია ფრჩხილებში მაშინ ტერმინალი გამოიტანს ერორს
