# 1) ჩამოწერეთ აქამდე ნასწავლი ფუნქციები, თქვენი დავალებაა: დაწეროთ რომელი არ 
# გამოიტანს ეროს თუ არგუმენტში არ გადავცემთ არაფერს. და რომელი გამოიტანს ერორს, 
# აუცილებლად მოიყვანეთ მაგალითი და ახსენით დეტალურად.

# 2) კომენტარებით ახსენი როდის ვიყენებთ დოტნოტაციას(dot notation).

# 3) შექმენი ცვლადი სადაც შეინახავ შენს სახელს, რომელიც გეწერება პატარა ასოებით, 
# გამოიყენე მეთოდი რომელიც გაადიდებს თქვენი სახელის ასოებს.

# 4) შექმენი ცვლადი სადაც შეინახავ შენი საყავრელი სპორტის სახელს დიდი ასოებით. 
# გამოიყენე მეთოდი რომელიც დააპატარავებს.

# 5) შექმენი ცვლადი სადაც შეინახავთ თქვენს გვარს პატარა ასოებით. გამოიყენე მეთოდი 
# რომელიც გაადიდებს მხოლოდ პირველ ასოს.

 #==============================================================================================

# print() - არ გამოიტანს ერორს და ის გვეხმარება რომ გამოვიტანოთ მასზე მინიჭებული მნიშვნელობა 
# ტერმინალში

# input() - არ გამოიტანს ერორს და ის გვეხმარება მომხმარებელს შევაყვანინოთ რამე მნიშვნელობა

# int() - არ გამოიტანს ერორს და ის გვეხმარება მონაცემი გადავაქციოთ ინტეჯერის მონაცემის ტიპად

# str() - არ გამოიტანს ერორს და ის გვეხმარება მონაცემი გადავაქციოთ მონაცემი სტრინგ ტიპად

# float() - არ გამოიტანს ერორს და ის გვეხმარება მონაცემთა ტიპი გადავაქციოთ ფლოუტად

# boolean() - არ გამოიტანს ერორს და ის გვეხმარება მონაცემთა ტიპი გადავაქციოთ ბულიანად

# type() - გამოიტანს ერორს და ის გვეხმარება შევამოწმოთ თუ რა მონაჩემთა ტიპია კონკრეტული მონაცემი



# dot notation - ს ვიყენებთ რომ upper,lower,capitalize მივანიჭოთ რაიმე კოდის ნაწილს


name = "niko"

print(name.upper())

sport = "FOOTBALL"
print(sport.lower())

Lastname = "tsomaia"
print(Lastname.capitalize())