# 1)სიის ელემენტის ამოღება ინდექსით

# დაწერე სია: nums = [10, 20, 30, 40]
# მომხმარებელი შეიყვანს ინდექსს და პროგრამა დაბეჭდავს შესაბამის ელემენტს.

# თუ ინდექსი არ არსებობს → დაიჭირე შეცდომა და დაბეჭდე: "ასეთი ინდექსი არ არსებობს".

nums = [10, 20, 30, 40]

try:
    inp = int(input("enter a index: "))
    print(nums[inp])
except IndexError:
    print("ასეთი ინდექსი არ არსებბს.")











try:
    inp4 = int(input("შეიყვანე x: "))
    inp3 = int(input("შეიყვანე y: "))



    print(inp3 + inp4)
except ValueError:
    print("მხოლოდ რიცხვები შეიყვანე")
# -----------------------------------------------------------------------------------
# 2)ლექსიკონიდან (dict) მნიშვნელობის მიღება

# დაწერე dict: prices = {"apple": 2, "banana": 3}
# მომხმარებელი შეიყვანს პროდუქტს და დაბეჭდე ფასი prices[product].

# თუ ასეთი key არ არსებობს → დაიჭირე შეცდომა და დაბეჭდე: "ასეთი პროდუქტი ვერ მოიძებნა"(დაგჭირდებათ KeyError).
prices = {
    "apple": 2,
    "banana": 3
    }
try:
    inp2 = input("enter a product name: ")
    print(prices[inp2])

except KeyError:
    print("ასეთი პროდუქტი ვერ მოიძებნა")


# ---------------------------------------------------------------------------------------------------------------
# 3)სტრინგის რიცხვად გადაყვანა + დამატება

# მომხმარებელი შეიყვანს ორ მნიშვნელობას x და y (როგორც ტექსტი).
# შენი მიზანია გადაიყვანო int-ად და დაბეჭდო ჯამი.

# თუ რომელიმე არ არის რიცხვი → "მხოლოდ რიცხვები შეიყვანე".

try:
    inp4 = int(input("შეიყვანე x: "))
    inp3 = int(input("შეიყვანე y: "))
    print(inp3 + inp4)

except ValueError:
    print("მხოლოდ რიცხვები შეიყვანე!")