# 1) შეასრულე Sololearn-ის ეს თავები.

# 2) მომხმარებელს შემოატანინე ნებისმიერი სეზონი:გაზაფხული,ზაფხული,შემოდგომა,
# ზამთარი თუ მომხმარებლის შემოყვანილი სეზონი უდრის გაზაფხულს დაპრინტე 1-იანი, 
# თუ უდრის ზაფხულს დაპრინტე 2-იანი, თუ უდრის შემოდგუმას დაპრინტე 3-იანი, თუ 
# უდრის ზამთარს დაპრინტე 4-იანი. ხოლო სხვა შემთხვევაში დაპრინტე erorr.

# 3) მომხმარებელს შემოატანინე ნებისმიერი რიცხვი. თუ მომხმარებლის შემოყვანილი 
# რიცხვი უდრის შენს საყვარელ რიცხვს დაპრინტე ჩემი საყვარელი რიცხვია ეს რიცხვი! 
# ხოლო სხვა შემთხვევაში დაპრინტე, ეს არ არის ჩემი საყვარელი  რიცხვი

# 4) მომხმარებელს შემოაყვანინე ნებისმიერი ფერი. თუ მომხმარებლის შემოყვანილი ფერი 
# უდრის შენს ფერს, დაპრინტე ეს არის ჩემი საყვარელი ფერი. ხოლო სხვა შემთხვევაში 
# დაპრინტე ეს არ არის ჩემი საყვარელი ფერი 

user_season = input("Enter a season: ")
season1 = 'გაზაფხული'
season2 = "ზაფხული"
season3 = "შემოდგომა"
season4 = "ზამთარი"

if user_season == season1:
    print(1)
elif user_season == season2:
    print(2)
elif user_season == season3:
    print(3)
elif user_season == season4:
    print(4)
else:
    print("Error")




user_input = int(input("Enter a number: "))

if user_input == 7:
    print("ეს არის ჩემი საყვარელი რიცხვი!")
else:
    print("ეს არ არის ჩემი საყვარელი რიცხვი!")




user_color = input("Enter a color: ")

if user_color == "black":
    print("ეს არის ჩემი საყვარელი რიცხვი!")
else:
    print("ეს არ არის ჩემი საყვარელი რიცხვი!")