# 1)შექმენით სია სადაც გექნებათ რიცხვები მოცემული და 

# ახალ სიაში ჩაამატეთ ისეთი რიცხვები რომლებიც იყოფა 3ზეც და 5 ზეც

# 2)შექმენით სია სადაც გექნებათ მოცემული სახელები, შემდეგ ახალ სიაში ჩაამატეთ ისეთი სახელები 
# სახელები რომლის სიმბოლოების რაოდენობაც არის ლუწი რიცხვი

# 3) ახსენით კომენტარებით რაში გვჭირდება list comprehension

#=======================================================================================
list1 = [2,4,5,10,12,17,20,30,35,47]
empty = []

for i in list1:
    if i % 3 == 0 and i % 5 == 0:
        empty.append(i)

names = ["luka","gio","mariami","nika","irakli"]
for x in names:
    if len(x) % 2 == 0:
        empty.append(x)

# list comprehension   გვიჭირდება რომ უფრო ეფეკტურად სწრაფად და მოკლედ დავწეროთ ჩვენი კოდი
