# 1) შეასრულე Sololearn-ის ეს თავები.

# 2) კომენტარებით ახსენით რას აკეთებს len ფუნქცია. და მოიყვანეთ მაგალითი.

# 3) შექმენით სია სადაც ჩაწერთ ნებისმიერ მონაცემთა ტიპის მნიშვნელობას. და 4-ე ინდექსზე მდგომი 
# ელემენტი შეცვალე თქვენი გვარით.

# 4) შექმენი სია სადაც შეინახავთ თქვენი საყვარელი მეგობრების სახელებს. საბოლოოს 2-ე და 4-ე ინდექსზე 
# მდგომი ელემნტი შეცვალე შენი საყვარელი რიცხვით.

# 5) შექმენით სია სადაც იქნება რიცხვები 1 დან 20-მდე. და დაბეჭდე ლუწ ინდექსზე მდგომი ელემენტები.

# 6) აუცილებლად გადახედეთ დღევანდელ გაკვეთილს.

#-------------------------------------------------------------------------------------------------------\


# len -  ფუნქცია გვეხმარება დავითვალოთ რამდენი ელემენტი/ასო/რიცხვი აქვს სიას ან 
# ცვლადის მნიშვნელობას და გამოიტანს პასუხს მაგალითად:

# num = [3,5,1,8,5.3]
# print(len(num))

names = ["vitali","irakli",5,3,1,9,10,42]
names[4] = "Tsomaia"

friends = ["Luka","Nika","niko","luka n2","Irakli n2 ","irakli"]
friends[2] = 7
friends[4] = 7

numbers = [1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20]
print(numbers[2])
print(numbers[4])
print(numbers[6])
print(numbers[8])
print(numbers[10])
print(numbers[12])
print(numbers[14])
print(numbers[16])
print(numbers[18])
print(numbers[20])