# 1) კომენტარებით ახსენი რა არის Slicing. და რაში ვიყენებთ.

# 2) შექმენი სია სადაც შეინახავ ოჯახის წევრების სახელებს. საბოლოოდ დაბრინტე პირველი სამი ელემენტი.

# 3) შექმენი სია სადაც შეინახავ ნებისმიერ მონაცემთა ტიპის მნიშვნელობას. საბოლოოდ დაბრინტე 
# ბოლო ხუთი ელემენტი.

# 4) შექმენი ცვლადი სადაც შეინახავ შენს სახელს. და Slicing-ის დახმარებით დაბეჭდე შენი სახელის 
# ბოლო სამი ასო.

# 5) მომხმარებელს შემოაყვანინე თავისი საყვარელი მანქანის სახელი. საბოლოოდ დაპრინტე მომხმარბლის 
# შემოყვანილი მნიშვნელობიდან პირველი სამი ასო.


#----------------------------------------------------------------------------------------

# slicing - ნაწილები ჩვენ მას ვიყენებთ რომ მაგალითად 1 დან 3 ინდექსამდე გამოიტანოს ელემენტები მაგალითად:
# num = [12,46,21,96,23]
# print(num[1:4])


family = ["გურანდა","გიორგი","ელენე","ლიკა"]
print(family[0:3])

numbers = [1,61,24,78,12,97,32,12]
print(numbers[3:8])

name = "Niko"
print(name[1:4])


favourite_car = input("Enter your favourite car:")
print(favourite_car[0:3])