
#TypeError - ეს ერორი იმ შემთხვევაშია თუ არასწორ მონაცემის ტიპს ვიყენებთ მაგ. print(6 + "randomi")

#ValueError - ეს ერორი იმ შემთხვევაშია თუ არასწორ მნიშვნელობას ვიყენებთ  მაგ. print(int("randomi"))

#IndexError -  ეს ერორი იმ შემთხვევაშია თუ მიუწვდომელ ინდექს ვხმარობთ მაგ. nums = [1,2,3,4,5] print(nums[8])

#SyntaxError - ეს ერორი იმ შემთხვევაშია თუ კოდი გვიწერია არასწორად/აკლია რაიმე მაგ. print"k")

#NameError - ეს ერორი იმ შემთხვევაშია თუ მითითებული ცვლადი არ არის შექმნილი მაგ. print(name)

#KeyError - ეს ერორი იმ შემთხვევაშია თუ მოცემული გასაღები ლექსიკონიდან არ არსებობს

#ZeroDivisionError - ეს ერორი იმ შემთხვევაშია თუ შევეცდებით რომ გავყოთ/გავამრავლოთ ინტეჯერი/ფლოუტი ნულზე

a = 5
b = 0

try:
    print(a/b)
except ZeroDivisionError:
    print("0 - ზე გაყოფა არ შეიძლება!")