# print - გვეხმარება დავბეჭდოთ კონკრეტული მონაცემი

# string(str) - არის მონაცემი რომელიც არის მოქცეული ბრჭყალებში

# integer(int) - ინტეჯერი არის ნებისმიერი მთელი რიცხვი

# float - არის ნებისმიერი ათწილადი რიცხვი

# variable(ცვლადი) - არის ფუნქცია რაშიც შეგვიძლია შევინახოთ 
# მნიშვნელობა

# input() - არის მნიშვნელობის შესაყვანი ფუნქცია

# while() - სანამ პირობა ჭეშმარიტია იქამდე იმუშავებს კოდი

# for - ფუნქცია გვემარება გამოვიტანოთ: სტრინგის მნიშვნელობა 
# ცალ-ცალკე, რიცხვები, მნიშვნელობები.

# if - თუ პირობა არის True პასუხის მიხედვით გამოაქვს 
# შედეგი

# elif - if ი თუ არის ფალსი მაგ შემთხვევაში ეკითხება მეორე 
# შეკითხვას

# else - სუყველა სხვა შემთხვევაში გამოიტანს მასში ჩანესტებილ/ჩაშენებულ პირობას

# snake_case - სიტყვების შორის აქვს ქვედატირე

# PascalCase - სიყვების პირველი ასო არის Capital ასო

# camelCase - პირველი სიტყვის მერე დანარჩენი სიტყვის ასო არის Capital ასო