# 1) გადახედეთ ჩანაწერს აუცილებლად და გაიმეორეთ განვლილი მასალა

# 2)შექმენით 5 ელემენტიანი Tuple და unpacking ის გამოყენებით თითოეულ ელემენტს მიანიჭეთ შესაბამისი 
# ცვლადი

# 3)ახსენით კომენტარებით რა არის tuple და რით განსხვავდება ის list ისგან

# 4)შექმენით 6 ელემენტიანი tuple და გამოიყენეთ .index() და .count() მეთოდები

# 5) კომენტარებით ახსენით რა არის *rest

#====================================================================================================

#2)
names = ("Gela","Lukamod","admingegechkori","datomod","irakli")

name1,name2,name3,name4,name5 = names

#3)
# tuple - არის კოლექციის ცვლადი რაც ინახავს ერთ ან მეტ ელემენტებს და ის list -ისგან იმით განსხვავდება რომ 
# ის არის immutable

#4)
nums = (1,2,3,4,5,6)
print(nums.count(1))
print(nums.index(3))

#5)
#*rest - სუყველა დარჩენილი ელემენტი მნიშვნელობად გადაეცემა *rest -ს