# 1) შექმენი ცვლადი სადაც შეინახავ შენს საყვარელ სპორტის სახელს შემდეგ for ციკლით 
# გადაუარეთ ცვლადს და გამოიტანეთ თქვენი საყვარელი სპორტის სახელი ცალ-ცალკე.

# 2) შექმენი while ციკლი. სადაც გამოიტან რიცხვებს 1 დან 100 მდე და ყოველ იტერაციაზე 
# უნდა დაუმატო 4-იანი.

# 3) შექმენი for ციკლი სადაც გამოიტან 0-დან  499 ის ჩათვლით ლუწ რიცხვებს.

# 4) დაწერე პროგრამა, რომელიც ითხოვს მომხმარებლის საყვარელ რიცხვს და არ ჩერდება 
# მანამ, სანამ სწორ რიცხვს არ შეიყვანს.თუ მომხმარებელი შეიყვანს სხვა ციფრს, პროგრამამ 
# უნდა სთხოვოს თავიდან შეიყვანოს.როდესაც სწორი რიცხვი იქნება შეყვანილი — პროგრამამ 
# უნდა დაბეჭდოს, რომ ეს პასუხი სწორია.


fav_sport = "football"
for i in fav_sport:
    print(i)

num = 0
while num < 101:
    print(num)
    num = num + 4


for i  in range(0,499,2):
    print(i)


num1 = int(input("Enter your favourite number: "))
if num1 == 7:
    print("Thats my favourite number!")
else:
    while num1 != 7:
        print("Thats not my favourite number!")
        num1 = int(input("Enter your favourite number: "))