#ფუნქცია - ფუნქცია არის კოდის ბლოკი რომელიც შეგვიძლია გამოვიყენოთ 1 ხელ ან მეტჯერ


#print() - გვეხმარება გამოვიტანოთ კონკრეტული შედეგი ტერმინალში

#input() - გვეხმარება მომხმარებელს შემოვაყვანინოთ კონკრეთული მონაცემი

#int() - გვეხმარება მონაცემი გავხადოთ ინტეჯერი
#str() - გვეხმარება მონაცემი გავხადოთ სტრინგი
#bool() - გვეხმარება მონაცმეი გავხადოთ ბულიანი
#float() - გვეხმარება მონაცემი გავხადოთ ფლოუთი

#range() - გვეხმარება შევქმნათ რიცხვების თანმიმდევრობა

#len() - გვეხმარება დავითვალოთ სიმბოლოები/ელემენტები