# 1) კომენტარების სახით ახსენი ნასწავლი მეთოდები რომელსაც ახსნით თითოეულს რა რას აკეთებს და 
# მოიყვანეთ ორ-ორი მაგალითი თითოეულ მეთოდზე:


names = ["adminigegechkori","nikacomi"]
nums = [2,3,4,5,9]

# .append() - გვეხმარება დავამატოთ ელემენტი სიის ბოლოს
# names.append("LukaTvali")

# .clear() - გვეხმარება ამოვშალოთ სუყველა ელემენტები
# names.clear()

# .copy() - გვეხმარება დავაკოპიროთ კონკრეტული სია
# names.copy()

# .count() - გვეხმარება დავითვალოთ მასზე გადაცემული ელემნტი რამდენია ერთნაირი
# names.count("adminigegechkori")

# .extend() - გვეხმარება გავაერთიანოთ ორი სია
# names.extend(nums)

# .index() - გვეხმარება გავიგოთ რომელ ინდექსზე დგას კონკრეტული ელემენტი
# names.index("adminigegechkori")

# .insert() - გვეხმარება დავამატოთ ელემენტი სასურველ ინდექსზე
# names.insert(2,"OtoMoto")

# .pop() - გვეხმარება წავშალოთ კონკრეტულ ინდექსზე მდგომი ელემენტი
# names.pop(1)

# .remove() - გვეხმარება წავშალოტ კონკრეტული ელემენტი
# names.remove("OtoMoto")

# .reverse() - გვეხმარება შემოვაბრუნოთ ელემენტების განლაგი
# names.reverse()

# .sort() - გვეხმარება დავალგოთ სია სტრინგების შემტხვევაში ასოებით რიცხვების შემთხვევაში რიცხვების მიხედვით
# names.sort()
