# 1) კომენტარებით ახსენით რა არის სია და რამდენი მონაცემთა ტიპის შენახვა შეგვიძლია.

# 2) შექმენი სია სახელად names და შეინახეთ თქვენი ოჯახის წევრების სახელები. სააბოლოოდ 
# დაბეჭდეთ 1-ლი და 3-მე ელემენტები.

# 3) შექმენი სია სახელად numbers და შეინახეთ 10-ი რენდომ რიცხვი. სააბოლოოდ 0-ლე ინდექსზე 
# მდგომი ელემენტი გახადეთ თქვენი სახელი.

# 4) შექმენი სია სადაც შეინახავ ნებისმიერ მონაცემთა ტიპის მნიშვნელობას მაქსიმუმ 10 მნიშვნელობა 
# რომ იყოს. საბოლოოდ დაბეჭდეთ კენტ ინდექსზე მდგომი ელემენტები.

#==================================================================================================

# სია არის ცვლადში რამოდენიმე მნიშვნელობის საცავი და 
# ელემენტები შეგვიძლია გამოვიძახოთ ინდექსებით

names = ["Elene","Guranda","giorgi"]
print(names[0])
print(names[2])

numbers = [2,6,32,8,10,4,7,3,43,5]
numbers[0] = "niko"

nums = [3,7.6,3,9,1.9,24,2]
print(nums[1])
print(nums[3])
print(nums[5])