# # classwork 

# 1)მიმატება: შექმენი lambda ფუნქცია, რომელიც იღებს ერთ რიცხვს და მას 15-ს უმატებს.
new_func = lambda num1,num2: num1 + num2
# 2)გამრავლება: შექმენი lambda ფუნქცია, რომელიც იღებს ორ არგუმენტს (x და y) და აბრუნებს მათ ნამრავლს.
new_func2 = lambda x,y: x * y
# 3)ტექსტის შებრუნება: დაწერე lambda, რომელიც მიღებულ სტრიქონს (string) უკუღმა დაწერს (მაგალითად: "Python" -> "nohtyP").

# მინიშნება: გამოიყენე სლაისინგი.


# 4)სიტყვების სიგრძე: გაქვს სია: ["apple", "banana", "cherry", "kiwi"]. დაასორტირე ის სიტყვების სიგრძის მიხედვით.

# 5)ბოლო ასო: იგივე სია დაასორტირე სიტყვების ბოლო ასოს მიხედვით.

# 6)Tuples დალაგება: გაქვს პროდუქტების სია ფასებით: [("Milk", 3), ("Bread", 2), ("Cheese", 5)]. დაასორტირე ეს სია ფასის მიხედვით (ზრდადობით).

# 7)ახსენი რა არის lambda და რაში გვჭირდება და რითი განსხვავდება ჩვეულებრივი ფუნქციისგან == ლამბდა გვეხმარება დავწეროთ კოდი მოკლედ და უფრო ჩქარად და ის არის ანონიმური ფუნქცია რაც ნიშნავს იმას რომ სახელის მოფიქრება არ გვჭირდება ფუნქციისთვის



