# 1) შეასრულეთ Sololearn-ის ეს თავები.

# 2) შექმენი სეტი სახელად freands_goa სადაც ჩაწერთ დაახლოებით ხუთ ადამიანს რომლებიც გოაში 
# გაიცანით და დამეგობრდით, შექმენით მეორე ცვლადი სახელად freands სადაც შეიყვანთ 5 მეგობარს 
# რომლებიც გოაში შემოსვლამდე გაიცანით, ეს ორი სეტი გააერთიანეთ ერთმანეთთან და იპოვეთ მათ შორის 
# განსხვავება.

# 3) შექმენით სეტი სახელად cars სადაც გადაცემთ რამოდენიმე მანქანის მოდელს საბოლოოდ წაშალეთ 
# ყველაზე ნაკლებად რომელიც არ მოგწონთ ის და დაამატეთ თქვენი საუკეთესო მანქანის მოდელი.

# 4) შექმენი dictionary სადაც გექნებათ: სახელი, გვარი, საკვარელი მანქანა და საყვარელი პროგრამირების 
# აკადემია საბოლოოდ დაბეჭდეთ საყვარელი მანქანის მნიშვნელობა.

# 5) გადახედეთ ქვემოთ მოცემულ რესურს და ვიდეოს რათა გაიმყაროთ ცოდა და აუცილებლად გადახედეთ 
# ჩანაწერს. 

#============================================================================================


friends_goa = {"ბაგონი გიორგი","ბატონი სანდრო","ამიკო","ნიკუშა","გეგა ფირცხელავა"}
friends = {"ირაკლი","ლუკა","გიორგი","ალექსი","გურამი"}
friends = friends.union(friends_goa)
print(friends.difference())

cars = {"mercedes c300 amg","bmw e60","mitsubishi lancer mr","nissan 350z"}
cars.pop()
cars.add("bmw e36")
print(cars)

favs = {
    "name":"Niko",
    "surname":"Tsomaia",
    "Favourite car":"BMW E36",
    "Favourite Programming Academy":"The one and only GOA"
}
print(favs.get("Favourite car"))