# 1) შეასრულეთ Sololearn-ის ეს თავი.

# 2) კომენტარებით ახსენი რას აკეთებს len() ფუნქცია და მოიყვანე მაგალითი.

# 3) კომენტარებით ახსენით დღევანდელ გაკვეთილზე ნასწავლი სიის მეთოდები და მოიყვანეთ თითო-თითო 
# მაგალითები:
# .append()
# .insert()
# .pop()


# 4) შექმენი სია სადაც შეინახავთ ნებისმიერ მონაცემთა ტიპის მნიშვნელობას. საბოლოოდ სიის ბოლოს 
# დაამატეთ თქვენი სახელი.

# 5) შექმენი სია სადაც შეინახავთ თქვენი ოჯახის წევრების სახელებს. საბოლოოდ 2-ე ინდექსზე მდგომი 
# ელემენტი შეცვალეთ თქვენი საყვარელი ცხოველის სახელი.

# 6) შექმენით სია სადაც გექნებათ რიცხვები 1 დან 10-ის ჩათვლით. საბოლოოდ წაშალეთ 4-ე ინდექსზე 
# მდგომი ელემენტი.

# 7) აუცილებლად გადახედეთ დღევანდელ ჩანაწერს.

#==================================================================================================

# 2)

# len() - ლენ ფუნქცია გვეხმარება დავითვალოთ მრავალ ელემენტიანი სიის და 1 ელემენტიანი 
# სიის ელემენტების/ასოების რაოდენობა.



# 3)

# .append() - გვეხმარება დავამატოთ ახალი ელემენტი სიის ბოლოში მაგალითი:

names = ["Zura","Niko"]

names.append("Sandro")

# .insert() - გვეხმარება დავამატოთ ელემენტი ჩვენს სასურველ ინდექსზე მაგალითი:

names1 = ["Luka","Giorgi"]
names1.insert(2,"Irakli")

# .pop() - გვეხმარება ამოვშალოთ ელემენტი სიიდან მაგალითი:

names2 = ["Sandro","Dato"]

names2.pop(1)


# 4)

nums = [1,2,52,4,9]
nums.append("Niko")



# 5)

family = ["Elene","Guranda","Giorgi"]

family.insert(2,"Lion")



# 6)

num = [1,2,3,4,5,6,7,8,9,10]

num.pop(4)