# 1) კომენტარებით ახსენით and და or ოპერატორი მოიყვანეთ ორ-ორი მაგალითი.

# 2) შექმენი ცვლადი სადაც შეინახავთ თქვენს სახელს, for ციკლით გადაუარეთ ცვლად და დაბეჭდეთ ცალ-ცალკე.

# 3) შექმენი while ციკლი სადაც გამოიტანს 1 დან 20 ამდე ლუწ რიცხვებს.

# 4) შექმენი სია სადაც შეინახავ 10 ნებისმიერ მონაცემთა ტიპის ელემენტს, შენი დავალებაა წაშალო მეორე ინდექსზე მდგომი ელემენტი და სიის 
# ბოლოს დაამატო საკუთარი სახელი.

# 5) შექმენით სია სადაც გექნებათ შენახული რიცხვები 1 დან 10-ის ჩათვლით, საბოლოოდ პირველ იდექსზე ჩაამატეთ თქვენი გვარი.


# and - როცა ორივე პირობა არის True მაშინ გამოიტანს True - ს და თუ 1 მაინც არის False - ი გამოიტანს False - ს

# or - თუ 1 პირობა მაინც არის True გამოიტანს True - ს

# 1)

num = 12
num1 = 15


print(num > 5 and num1 < 21) # ---> აქ გამოიტანს True - ს იმიტორო ორივე პირობა არის True

print(num > 13 and num1 > 5) # ---> აქ გამოიტანს False - ს იმიტორო ერთ-ერთი პირობა არის False


print(num > 5 or num1 < 21) # ---> აქ გამოიტანს True - ს იმიტორო or ოპერატორს ვხმარობთ და ტუ ერთ-ერთი მაინც არის 
#True ჩვენ მივიღებთ True - ს

print(num > 13 or num1 < 5) # ---> აქ გამოიტანს False - ს იმიტორო ორივე პირობა არის False



# 2)

name = "Niko"

for i in name:    # ---> აქ შედეგი იქნება N , i , k , o 
    print(i)



# 3)

num2 = 0

while num2 < 21:  # ---> აქ შედეგი იქნება 0 იდან 20 ის ჩათვლით ლუწი რიცხვები
    print(num2)
    num2 += 2


# 4)

nums = [1,2,3,4,5,6,7,8,9,10]      # ---> აქ სია გახდება nums = [1,2,4,5,6,7,8,9,10,"Tsomaia"]
nums.pop(2)
nums.append("Tsomaia")


# 5)

nums1 = [1,2,3,4,5,6,7,8,9,10]       # ---> აქ სია გახდება nums1 = [1,"Tsomaia",2,3,4,5,6,7,8,9,10]

nums1.insert(1,"Tsomaia")