# 1) შექმენით სია სადაც შეინახავთ ნებისმიერ მონაცემთა ტიპის მნიშვნელობას, საბოლოოდ წაშალეთ 
# მე-5 ელემენტი და სიის ბოლოს დააამატეთ თქვენი გვარი.

# 2) შექმენით სია სადაც შეინახავთ რიცხვებს 1-დან 10-მდე, საბოლოოდ დაბეჭდეთ პირველი ხუთი 
# ელემენტი.

# 3) შექმენი for ციკლი სადაც გამოიტანთ რიცხვებს 1-დან 20-მდე ლუწი რიცხვები.

# 4) შექმენი ფუნქცია რომელსაც გადაეცემა ორი პარამეტრი, საბოლოოდ დაბეჭდეთ ამ რიცხვების ნამრავლი.

# 5) შექმენი ფუნქცია რომელსაც გადაეცემა ერთი პარამეტრი , თუ რიცხვი იქნება ლუწი დაბეჭდეთ "Even" 
# ხოლო სხვა შემთხვევაში დაბეჭდეთ "Odd".

# 6) აუცილებლად გადახედეთ ჩანაწერს.


#======================================================================================================


# 1)

nums1 = ["Luka","Nika","Giorgi","Saba","Irakli","Vitali"]

nums1.pop(5)
nums1.append("Tsomaia")


# 2)

nums = [1,2,3,4,5,6,7,8,9,10]

print(nums[0:5])


# 3)

for i in range(0,21,2):
    print(i)



# 4)

def multiply(num1,num2):
    print(num1*num2)

multiply(2,5)



# 5)

def filter(numfilter):
    if numfilter % 2 == 0:
        print("Even")
    else:
        print("Odd")

filter(5)