# 1) კომენტარებით ახსენით რა არის სია და რამდენი მონაცემთა ტიპის შენახვა შეგვიძლია.

# 2) შექმენი სია სახელად names და შეინახეთ თქვენი ოჯახის წევრების სახელები. 
# სააბოლოოდ დაბეჭდეთ 1-ლი და 3-მე ელემენტები.

# 3) შექმენი სია სახელად numbers და შეინახეთ 10-ი რენდომ რიცხვი. სააბოლოოდ 
# 0-ლე ინდექსზე მდგომი ელემენტი გახადეთ თქვენი სახელი.

# 4) შექმენი სია სადაც შეინახავ ნებისმიერ მონაცემთა ტიპის მნიშვნელობას მაქსიმუმ 
# 10 მნიშვნელობა რომ იყოს. საბოლოოდ დაბეჭდეთ კენტ ინდექსზე მდგომი ელემენტები.

#==================================================================================================

#სია არის ცვლადი მაგრამ მას მინიჭებული აქვს მნიშვნელობები ოთკუთხედი ფრჩხილებით და ჩვენ შეგვიძლია
#შევინახოთ სუყველა მონაცემთა ტიპი

names = ["გურანდა","გიორგი","ელენე"]
print(names[0])
print(names[2])

numbers = [1,4,2,7,3,9,12,8,23,10]
numbers[0] = "Niko"

num = ["Luka",21,5.13,5>2]
print(num[1])
print(num[3])