# 1) შექმენი სეტი სახელად fruits მასში შეინახეთ შესაბამისი 5 მნიშვნელობა. წაშალეთ ერთი ნებისმიერი 
# ხილი, ჩაამატეთ თქვენი საყვარელი ხილი, შექმენით მეორე სეტი სახელად fruits1 შეინახეთ ორი 
# მნიშვნელობა, ეს ორი სეტი ერთმანეთთან გააერთიანეთ და იპოვეთ ამ ორ სეტს შორის განსხვავება.

# 2) დღევანდელ გაკვეთილზე ნასწავლი მეთოდები კომენტარის სახით ახსენით.

# 3) შექმენი dictionary სადაც გექნება: სახელი, გვარი, ასაკი, საყვარელი სპორტი, საბოლოოდ დაბეჭდეთ 
# გასაღებები, მნიშვნელობა და ყველა ერთად.


set1 = {"red apple","mango","banana","grape","kiwi"}
set1.remove()
set2 = {"green apple","yellow apple"}
set1.union(set2)
set1.difference(set2)


#remove() - set ისგან შლის რანდომ ელემენტს
#union() - ორ set-ს აერთიანებს
#discard() - remove ის მსგავსად set ისგან შლის რანდომ ელემენტს
#difference() - ამოწმებს თუ ორ set-ს შორის რა არის განსხვავება ანუ
#clear() - შლის ყველა ელემენტს set-ში
#get() - აბრუნებს კონკრეტული გასაღების მნიშვნელობას
#copy() - აბრუნებს dictionary -ს კოპიორს
#keys() - აბრუნებს მხოლოდ გასაღებებს
#values() - აბრუნებს მხოლოდ მნიშვნელობებს

info ={
    "Name":"Niko",
    "Surname":"Tsomaia",
    "Age":12,
    "Fav_Sport":"Football"
}

print(info.keys())
print(info.values())
print(info.items())