# 1) გააკეთეთ სოლოლერნი და აიღეთ სერტიფიკატები, ვინც დაპოსტავს და დაგვთაგავს მე და ბატონ 
# ნიკას +50 აურა


# 2) შექმენით ფუნქცია, რომელსაც არგუმენტად გადაეცემა 3 რიცხვი და ფუნქციის მიზანი იქნება, რომ ამ 
# სამი რიცხვის ჯამი დააბრუნოს.

# 3) შექმენით ფუნქცია, რომელიც არგუმენტად მიიღებს მომხმარებლის სახელსა და ასაკს. ფუნქციამ უნდა 
# დააბრუნოს მსგავსი წინადადება:
# "მომხმარებლის სახელი" is "მომხმარებლის ასაკი" წლის.


# 4)გაიაზრეთ ეს კოდი:

# def sum_positives(numbers):
#     sum = 0
#     for i in numbers:
#         if i > 0:
#             sum = sum + i
#     return sum


#======================================================================================================

# 2)
def add(num1,num2,num3):
    print(num1+num2+num3)


# 3)

def sentance(name,age):
    print("მომხმარებელს ქვია", name, "და ის არის", age, "წლის")