# 1) შეასრულეთ Sololearn-ის ეს თავები.

# 2) შექმენი სია, სადაც შეინახავთ თქვენი საყვარელი ფეხბურთელების სახელებს და დაბეჭდეთ ბოლო 
# ორი ელემენტი უარყოფითი ინდექსების დახმარებით.

# 3) შექმენი ცვლადი სადაც შეინახავ ნებისმიერი ქალაქის სახელს და დაბეჭდეთ ქალაქის ბოლო ორი ასო.

# 4) მომხმარებელს შემოატანინე ნებისმიერი 4 ნიშნა რიცხვი და დაბეჭდეთ ბოლო სამი რიცხვი

# 5) მომხამრებელს შემოატანინე შენი გვარი. და საბოლოოდ დაბეჭდე პირველი ოთხი ასო.

# 6) აუცილებლად გადახედეთ დღევანდელ ჩანაწერს.


football_players = ["გიორგი მამარდაშვილი","ხვიჩა კვარაცხელია","გიორგი მიქაუტაძე","კრიასტიანო რონალდო"]
print(football_players[-2:])

city = "Tbilisi"
print(city[-2:])

numbers = input("Enter first a 4 digit number: ")
print(numbers[-3:])

Lastname = input("Enter your Lastname: ")
print(Lastname[0:4])

