# 2) მომხმარებელს შემოატანინეთ სიტყვა. ტერმინალში კი დაბეჭდეთ ეს სიტყვა ისე რომ იყოს:

# 1. ყველა პატარა ასო;
# 2. ყველა დიდი ასო;
# 3. პირველი ასო დიდი, ხოლო ყველა დანარჩენი პატარა.

# 3) მომხმარებელს შემოატანინეთ სამი წინადადება და თითოეულზე გამოიყენეთ სხვადასხვა სტრინგის მეთოდი:
# პირველ წინადადებაზე — .lower()
# მეორე წინადადებაზე — .upper()
# მესამე წინადადებაზე — .capitalize()

# 4) ცვლადში შეინახე შენი სახელი. მომხმარებელს შეეკითხე თავისი სახელი, იმ შემთხვევაში თუ თქვენი 
# სახელები ემთხვევა დაბეჭდეთ "Our names are similar!", თუ არ ემთხვევა დაბეჭდეთ "We have different "
# "names". გაითვალისწინეთ, რომ მომხმარებელმა შეიძლება თქვენნაირი სახელი შემოიტანოს, თუმცა სახელის 
# ასოები შესაძლოა იყოს სხვადასხვა შრიფტის ზომით, ამიტომ ამან თქვენ პროგრამაში შეფერხება არ უნდა 
# გამოიწვიოს (გამოიყენეთ ნასწავლი სტრინგის მეთოდები)

# 5) ცვლადში შეინახეთ წინადადება, დაწერეთ ისეთი პროგრამა რომ მხოლოდ წინადადების პირველი ასო 
# იყოს დიდი ასოთი, დანარჩენი კი იყოს პატარა.

# 6) ცვლადში შეინახეთ რაიმე სტრინგი, შემდეგ .find() ფუნქციის მეშვეობით იპოვეთ რომელ ინდექსზეა 
# კონკრეტული ასო.

# 7) შექმენით სია, სადაც დაამატებთ რამდენიმე სტრინგს. სიაში დამატებული თითოეული სტრინგი 
# გადაიყვანეთ დიდ ასოებად for ციკლის მეშვეობით.

# 8) ჩანაწერს გადახედეთ თავიდან.

#================================================================================================

# 2)

user_input = input("Enter a Word: ")
print(user_input.upper())
print(user_input.lower())
print(user_input.capitalize())


# 3)

user_input1 = input("Enter The First Word: ")
print(user_input1.upper())


user_input2 = input("Enter The Second Word: ")
print(user_input2.lower())

user_input3 = input("Enter The Third Word: ")
print(user_input3.capitalize())


# 4)

name = "Niko"

user_name = input("Enter Your Name: ")

if user_name.capitalize == name.capitalize:
    print("Our Names Are Simmilar!")


# 5)

words = "hello my name is Luka!"

print(words.capitalize())

# 6)

variable = "string"
print(variable.find("i"))



# 7)

names1 = ["Niko","Irakli","Guga","Luka"]

for i in names1:
    print(i.upper())