# 2) შექმენით dictionary სახელად student, დაამატეთ მას მონაცემები: name, hobby, height, weight. 
# შემდეგ გამოიყენეთ .get() მეთოდი name-ის მისაღებად და .pop() მეთოდი height-ის წასაშლელად. 
# დაუმატეთ კომენტარები, რას აკეთებს თითოეული მეთოდი

# 3) დაწერეთ ფუნქცია, რომელიც იღებს ლექსიკონს და აბრუნებს მის keys-სა და values-ს .keys() და 
# .values() მეთოდებით. დაბეჭდეთ ორივე შედეგი და დაურთეთ კომენტარები

# 4) შექმენით ლექსიკონი person და გამოიყენეთ .items() მეთოდი, რათა დაბეჭდოთ ყველა key და value 
# წყვილად. გამოიყენეთ loop და კომენტარი დაუმატეთ შედეგს

# 5) შექმენით ლექსიკონი animal, შექმენით მისი ასლი .copy() მეთოდით, შემდეგ კი გამოიყენეთ .clear() 
# ორივეზე (დასაწყისში და ბოლოს დაბეჭდეთ ორივე ლექსიკონი, კომენტარით)

# 6) დაწერეთ ფუნქცია, რომელიც იღებს ლექსიკონს და ამატებს ახალ წყვილს ('age': 14) .update() 
# მეთოდით, შემდეგ კი შლის ბოლო ელემენტს .popitem() მეთოდით. დაბეჭდეთ შედეგი და დაუმატეთ 
# კომენტარები

# 7) რიცხვების სიიდან "numbers = [1, 4, 7, 10, 13, 16, 19]" აირჩიეთ მხოლოდ კენტები, გაამრავლეთ 
# ორზე და დაამატეთ "new_list"-ში, ჯერ "for"-ით, შემდეგ list comprehension-ით. ბოლოს გააკეთეთ 
# 2 მსგავსი მაგალითი: ერთში მხოლოდ მოქმედება გამოიყენეთ, მეორეში მხოლოდ პირობა

student = {
    "name":"Niko",
    "hobby":"programming",
    "heigth":"1.60m",
    "weight":"60kg",
}

name = student.get("name")   # get - გვეხმარება ავიღოთ მნიშვნელობა კონკრტული გასაღებისგან
student.pop("heigth")     #pop - შლის კონკრეტულ item - ს ანუ key და value - ს


def dictt(dictt): #def - გვეხმარება შევქმნათ ფუნქცია
    print(dictt.keys())  #keys - გვეხმარება მივიღოთ ლექსიკონის გასაღებები
    print(dictt.values())  #values - გვეხმარება მივიღოთ ლექსიკონის მნიშვნელობები
    
dictt({"name":"luka",})

person = {
    "name1":"Luka",
    "name2":"Gio",
    "name3":"Dato"
}

for i in person.items(): #items - გვეხმარება გამოვიტანოთ ლექსიკონის გასაღებები + მნიშვნელობები
    print(i)


animal = {
    "animal1":"Tiger",
    "animal2":"Lion"
}

print(animal)

animal1 = animal.copy()
animal1.clear()
animal.clear()

print(animal)

def funcdict(dict1):
    dict1.update({'age': 14})  #update - გვეხმარება დავამატოთ ახალი გასაღები და მნიშვნელობა ლექსიკონში
    dict1.popitem()  #popitem - შლის ბოლო ელემენტს ლექსიკონიდან


numbers = [1, 4, 7, 10, 13, 16, 19]
new_list = []
for i in numbers:
    if i % 2 != 0:
        new_list.append(i * 2)  #append - გვეხმარება დავამატოთ კონკრეტული ელემენტი სიაში
new_list_comp = [i * 2 for i in numbers if i % 2 != 0]  #list comprehension -  გვეხმარება დავწეროთ კოდი უფრო ადვილად და მოკლედ