#1) კომენტარის სახით ახსენით რა არის მეთოდი და ახსენით მისი სინტაქსი.


#მეთოდი არის კოდის ბლოკი რომელიც გამოიყენებეა მხოლოდ 1 მონაცემთა ტიპთან მაგალითად არის:
#Capitalize და ის გვეხმარება რომ სტრინგის პირველი ასო შევცვალოთ დიდი ასოთი და ის იწერება
#dot notation - ით: "Print("Luka".Capitalize())"



# 2) კომენტარის სახით ახსენით დღევანდელ გაკვეთილზე ნასწავლი მეთოდები და მოიყვანე თითოეულზე 
# თითო-თითო მაგალითი:
# upper() - გვეხმარება სტრინგის ასოები დიდი გავხადოთ.
# lower() - გვეხმარება სტრინგის ასოები პატარა გავახადოთ.
# capitalize() - გვეხმარება სტრინგის პირველი ასო დიდი გავხადოთ.
# find() - გვეხმარება ვიპოვოთ კონკრეტული ასო სტრინგში.
# count() - გვეხმარება დავითვალოთ მასზე მინიჭებული ასო რამდენჯერ არის გამოყენებული სტრინგში.
# isupper() - თუ სტრინგი მარტო დიდი ასოებია გამოიტანს True სხვა შემთხვევაში False.
# islower() - თუ სტრინგი მარტო პატარა ასოებია გამოიტანს True სხვა შემთხვევაში False.
# startswith() - თუ მასზე მინიჭებული ასოთი იწყება სტრინგი მაშინ გამოიტანს True სხვა შემთხვევაში False.
# endswith() - თუ მასზე მინიჭებული ასოთი მთავრდება სტრინგი მაშინ გამოიტანს True სხვა შემთხვევაში False.
# isalnum() - თუ სტრინგი შედგება რიცხვებგან/ასოებისგან თუ კი დააბრუნებს True თუ 
# არა დააბრუნებს.
# isalpha() - თუ სტრინგი მხოლოდ ასოებისგან შედგება და არ აქვს რიცხვები დააბრუნებს True თუ 
# რიცხვებისგანაც შედგება მაშინ დააბრუნებს False.
# isdigit() - თუ სტრინგი რიცხვებია გამოიტანს True სხვა შემთხვევაში False.
# swapcase() - ცვლის დიდ და პატარა ასოების სიდიდიეებს.


