# 1) შეასრულე Sololearn-ის ეს თავები.

# 2) კომენტარებით ახსენით რას აკეთებს len ფუნქცია. და მოიყვანეთ მაგალითი.

# 3) შექმენით სია სადაც ჩაწერთ ნებისმიერ მონაცემთა ტიპის მნიშვნელობას. 
# და 4-ე ინდექსზე მდგომი ელემენტი შეცვალე თქვენი გვარით.

# 4) შექმენი სია სადაც შეინახავთ თქვენი საყვარელი მეგობრების სახელებს. 
# საბოლოოს 2-ე და 4-ე ინდექსზე მდგომი ელემნტი შეცვალე შენი საყვარელი რიცხვით.

# 5) შექმენით სია სადაც იქნება რიცხვები 1 დან 20-მდე. და დაბეჭდე ლუწ ინდექსზე მდგომი ელემენტები.

# 6) აუცილებლად გადახედეთ დღევანდელ გაკვეთილს.

#====================================================================================================

# len - გვეხმარება დავითვალოთ ინდექსის ასოების/რიცხვებისან თვითონ სიის ელემენტების 
# რაოდენობა მაგალითად:
# names = ["Nika","Goga",12]
# print(len(names[0]))     < -- ეს არის ლენ ფუნქციის მაგალითი აქ ჩვენ მივიღებთ 4-ს იმიტორო 
# "Nika" - ს აქვს 4 ასო/რიცხვი


numbers = [12,6.2,7,8 > 3,1]
numbers[4] = "Tsomaia"


friends = ["Luka","irakli","gurami","dato","irakli.s"]
friends[2] = 7
friends[4] = 7

numbers1 = [1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20]
print(numbers1[2])
print(numbers1[4])
print(numbers1[6])
print(numbers1[8])
print(numbers1[10])
print(numbers1[12])
print(numbers1[14])
print(numbers1[16])
print(numbers1[18])
print(numbers1[20])
