# num = int(input('Enter a Number: '))
# if num > 20:
#     print("Good")
# else:
#     print("Bad")

# num1 = int(input('Enter second number: '))
# if num1 < 10:
#     print('Bad')
# else:
#     print('Good')




# 1) მომხმარებელს შემოატანინინე 1 დან 20 ამდე ნებისმიერი რიცხვი. თუ მომხმარებლის შემოყვანილი რიცხვი ნაკლებია 10 ზე ან მეტია ოცზე მაშინ დაპრინტე "good". ხოლო სხვა შემთხვევაში დაპრინტე "bad".

# 2) კომენტარებით ახსენით რას აკეთებს if, elif, else.

# 3) მომხმარებელს შემოატანინე შენი ასაკი. თუ შენი ასაკი მეტია 
# ან ტოლი 18 ზე მაშინ დაპრინტე "სრულწლოვანი". ხოლო სხვა 
# შემთხვევაში დაპრინტე არასრულწლოვანი.

# 4) მომხმარებელს შემოატანინე ნებისმიერი რიცხვი. თუ 
# მომხმარებლის შემოყვანილი რიცხვი იყოფა 2-ზე და ნაშთი 
# რჩება 0-ი დაპრინტე Even. ხოლო სხვა შემთხვევაში დაპრინტე Odd.

# 5) მომხმარებელს შემოატანინე ქულა 1 დან 10-მდე თუ 
# მომხმარებლის შეყვანილი ქულა მეტია ან ტოლი 8-ზე მაგ 
# შემთხვევაში დაპრინტე "თქვენ წარმატებით ჩააბარეთ გამოცდა". 
# ხოლო სხვა შემთხვევაში "თქვენ ჩაიჭერით.

number = int(input("Enter a number from 1 to 20: "))
if number < 20:
    print('Good')
else:
    print('Bad')

# if არის თუ მაგალითად:
# if 20 > 12
#    print('True')

# elif('თუ სხვა')

# else(სხვა) - თუ if არასწორია ანუ false მაგ შემთხვევაში სხვაში 
# მითითებული ფუნქციის შედეგს გამოიტანს ტერმინალი


age = int(input('Enter Your age: '))
if age >= 18:
    print('სრულწლოვანი ხარ')
else:
    print('არასრულწლოვანი ხარ')


points = int(input('Enter a number from 1 - 10: '))
if points >= 8:
    print('თქვენ ჩააბარეთ გამოცდა წარმატებით.')
else:
    print('თქვენ გამოცდა ვერ ჩააბარეთ')
