# 1) კომენტარის სახით ახსენით რა არის პარამეტრი.

# 2) შექმენი ფუნქცია, რომელსაც ექნება ორი პარამეტრი.
# ფუნქციამ უნდა დააბრუნოს ამ ორი რიცხვის ჯამი.

# 3) შექმენი ფუნქცია, რომელსაც გადაეცემა ერთი პარამეტრი.
# ფუნქციამ უნდა შეამოწმოს, არის თუ არა ეს რიცხვი ლუწი ან კენტი. თუ ლუწია დაბეჭდეთ Even, ხოლო თუ კენტია Odd.

# 4) რა არის ამ კოდში ერორი არ შეამოწმოთ თქვენით იფიქრეთ:
# def hello(name):
#     print("gamarjoba",name)
# hello("nika","saba")

# 5) აუცილებლად გადახედეთ დღევანდელ ჩანაწერს.

#====================================================================================================
# პარამეტრი არის დროებითი ცვლადი რაც შეგვიძლია გამოვიყენოთ რომ ჩვენ შექმნილ ფუნქციას გადავცეთ 
# რაიმე მნიშვნელობა


# 2)

def add(firstnum,secondnum):
    print(firstnum+secondnum)
add(1,4)


# 3)

def EvenOrOdd(num):
    if num % 2 == 0:
        print("Even")
    else:
        print("Odd")


# 4)

# def hello(name):
#     print("gamarjoba",name) ---> აქ პარამეტრი მითითებულია 1 და ჩვენ გადავეცით 2 რამაც გამოწვია
# # hello("nika","saba")           ერორი